physics/e&m.org

#+TITLE: E&M
#+OPTIONS: toc:nil
#+STARTUP: latexpreview

Lorentz's force

\[
\overrightarrow{F}_B = q(\overrightarrow{E} + \overrightarrow{v}\times\overrightarrow{B})
\]

Charge density

\[
nev_d = J = {i\over A}
\]

Permeability Constant
\[
\mu_0 = 4\pi \times 10^{-7} \si{T\cdot m / A}
\]
* Hall effect
There is a potential difference when a magnetic field is present in a wire, causing the charges to seperate within the wire. This results in a *Hall potential difference*
$V = Ed$ where d = width of strip

* Circulating particle

\[
r = \frac{mv}{|q|B}
\]

\[
f = \frac{|q|B}{2\pi m}
\]

* Force on a wire

\[
F_B = iL\times B
\]

* Torque on a coil

\[
\tau = NiAB\sin\theta = \mu \times B
\]
where
\[
\mu = NiA
\]

* Magnetic field due to current

\[
\dd\overrightarrow{B} =\frac{\mu_0}{4\pi}\frac{i\dd\overrightarrow{s}\times \hat r}{r^2} \hspace{10}\text{(Biot-Savart law)}
\]


The magnetic field at distance R from a long straight wire is

\[
B = \frac{\mu_0i}{2\pi R}
\]
